{
  "id": "joseph_louis_lagrange",
  "name": "Joseph-Louis Lagrange",
  "birth_year": 1736,
  "death_year": 1813,
  "nationality": "Italian-French",
  "fields": [
    "mathematics",
    "mechanics",
    "astronomy"
  ],
  "wikipedia_url": "https://en.wikipedia.org/wiki/Joseph-Louis_Lagrange",
  "wikipedia_data": {
    "url": "https://en.wikipedia.org/wiki/Joseph-Louis_Lagrange",
    "title": "Joseph-Louis Lagrange",
    "page_title": "Joseph-Louis_Lagrange",
    "biography_paragraphs": [
      "Joseph-Louis Lagrange[a] (born Giuseppe Luigi Lagrangia[5][b] or Giuseppe Ludovico De la Grange Tournier;[6][c] 25 January 1736 – 10 April 1813), also reported as Giuseppe Luigi Lagrange[7] or Lagrangia,[8] was an Italian and naturalized French mathematician, physicist and astronomer. He made significant contributions to the fields of analysis, number theory, and both classical and celestial mechanics.",
      "In 1766, on the recommendation of Leonhard Euler and d'Alembert, Lagrange succeeded Euler as the director of mathematics at the Prussian Academy of Sciences in Berlin, Prussia, where he stayed for over twenty years, producing many volumes of work and winning several prizes of the French Academy of Sciences. Lagrange's treatise on analytical mechanics (Mécanique analytique, 4. ed., 2 vols. Paris: Gauthier-Villars et fils, 1788–89), which was written in Berlin and first published in 1788, offered the most comprehensive treatment of classical mechanics since Isaac Newton and formed a basis for the development of mathematical physics in the nineteenth century.",
      "In 1787, at age 51, he moved from Berlin to Paris and became a member of the French Academy of Sciences. He remained in France until the end of his life. He was instrumental in the decimalisation process in Revolutionary France, became the first professor of analysis at the École Polytechnique upon its opening in 1794, was a founding member of the Bureau des Longitudes, and became Senator in 1799.",
      "Lagrange was one of the creators of the calculus of variations, deriving the Euler–Lagrange equations for extrema of functionals. He extended the method to include possible constraints, arriving at the method of Lagrange multipliers. Lagrange invented the method of solving differential equations known as variation of parameters, applied differential calculus to the theory of probabilities and worked on solutions for algebraic equations. He proved that every natural number is a sum of four squares. His treatise Theorie des fonctions analytiques laid some of the foundations of group theory, anticipating Galois. In calculus, Lagrange developed a novel approach to interpolation and Taylor's theorem. He studied the three-body problem for the Earth, Sun and Moon (1764) and the movement of Jupiter's satellites (1766), and in 1772 found the special-case solutions to this problem that yield what are now known as Lagrangian points. Lagrange is best known for transforming Newtonian mechanics into a branch of analysis, Lagrangian mechanics. He presented the mechanical \"principles\" as simple results of the variational calculus.",
      "In appearance he was of medium height, and slightly formed, with pale blue eyes and a colourless complexion. In character he was nervous and timid, he detested controversy, and to avoid it willingly allowed others to take the credit for what he had himself done."
    ],
    "infobox": {
      "birth": "Giuseppe Lodovico Lagrangia(1736-01-25)25 January 1736Turin, Kingdom of Sardinia",
      "death": "10 April 1813(1813-04-10) (aged 77)Paris, First French Empire",
      "nationality": "SardiniaFrench Empire",
      "fields": "MathematicsAstronomyMechanics"
    },
    "scraped_at": "2025-08-10T00:14:45.548517",
    "raw_html_length": 284665
  },
  "processed_at": "2025-08-10T00:14:47.053903",
  "page_views": 28563,
  "avg_daily_views": 320.93,
  "popularity_tier": "medium",
  "pageview_data": {
    "page_title": "Joseph-Louis_Lagrange",
    "period_days": 90,
    "start_date": "2025051200",
    "end_date": "2025081000",
    "total_views": 28563,
    "avg_daily_views": 320.93,
    "max_daily_views": 481,
    "popularity_tier": "medium",
    "data_points": 89,
    "retrieved_at": "2025-08-10T02:03:48.391250"
  },
  "timeline_events": [
    {
      "year": 1736,
      "year_confidence": "exact",
      "event_type": "birth",
      "description": "Born in Italy",
      "location": {
        "place_name": null,
        "raw_text": "25 January 1736",
        "confidence": 1.0
      },
      "source_text": "Joseph-Louis Lagrange[a] (born Giuseppe Luigi Lagrangia[5][b] or Giuseppe Ludovico De la Grange Tournier;[6][c] 25 January 1736 – 10 April 1813)",
      "confidence": 1.0,
      "extraction_metadata": {
        "model_version": "llama3.1:8b",
        "extracted_at": "2025-08-10T02:09:42.517547",
        "extraction_confidence": 1.0
      }
    }
  ],
  "timeline_extraction_metadata": {
    "extracted_at": "2025-08-10T02:09:42.517755",
    "model_used": "llama3.1:8b",
    "events_count": 1,
    "biography_length": 1070
  }
}