{
  "id": null,
  "name": "John Rowning",
  "birth_year": 1701,
  "death_year": 1771,
  "nationality": "European",
  "fields": [
    "mathematics"
  ],
  "wikipedia_url": "https://en.wikipedia.org/wiki/John_Rowning",
  "wikipedia_data": {
    "url": "https://en.wikipedia.org/wiki/John_Rowning",
    "title": "John Rowning",
    "page_title": "John_Rowning",
    "biography_paragraphs": [
      "John Rowning (c. 1701 – November 1771) was an English mathematician, clergyman, and philosopher. He wrote on natural philosophy, designed measuring and calculating instruments. In his book he rejected the idea of Newtonian ether and explained gravitational forces as being the action of God.",
      "Rowning was the son of a namesake from Ashby-with-Fenby, Lincolnshire who may have been a watchmaker as a brother took to the profession. He was educated in Glanford Brigg before joining Magdalene College, Cambridge as a sizar, graduating BA in 1724 and MA four years later. He become a teacher of experimental philosophy while also working with William Deane on the design of philosophical instruments. He designed a barometer with alterable accuracy using tubes of varying diameters in 1733.[1] He also wrote on graphical solutions to parabolic equations.[2] He was made rector at Westley Waterless, Cambridgeshire in 1734 and later at Anderby. He published A Compendious System of Natural Philosophy which went through revisions from 1735 to 1772. Rowning believed that matter could both attract and repel and included examples of  cohesion of mercury drops, other liquids, capillary rise and suggested that attractive forces worked at short ranges and that they begin to repel after a certain range.[3] Joseph Priestley was educated at Daventry Academy where Rowning's text was used and he followed the idea that particles could attract or repel depending on the distance in some of his views on optics.[4] Rowning believed that the brightness of stars varied only due to the distance from the earth.[5] He was a member and sometime secretary of the Gentleman's Society of Spalding.[6]",
      "He was married and had three sons and a daughter. He died at his home on Carey Street in London."
    ],
    "infobox": {},
    "scraped_at": "2025-08-11T01:12:08.077265",
    "raw_html_length": 73476
  },
  "processed_at": "2025-08-11T01:12:09.081659",
  "wikidata_info": {
    "wikidata_id": "Q18762011",
    "name": "John Rowning",
    "birth_year": 1701,
    "death_year": 1771,
    "birth_date_full": "1701-01-01T00:00:00Z",
    "death_date_full": "1771-01-01T00:00:00Z",
    "wikipedia_url": "https://en.wikipedia.org/wiki/John_Rowning",
    "nationality": "",
    "birth_place": {
      "name": "",
      "wikidata_uri": "",
      "coordinates": null
    },
    "image_url": "",
    "fields": [
      "mathematics"
    ],
    "data_source": "wikidata_sparql",
    "extracted_at": "2025-08-11T01:11:25.224787",
    "wikidata_query_metadata": {
      "query_date": "2025-08-11T01:11:25.224788",
      "endpoint": "https://query.wikidata.org/sparql",
      "data_quality": "structured"
    }
  }
}