{
  "id": null,
  "name": "John Robertson",
  "birth_year": 1707,
  "death_year": 1776,
  "nationality": "European",
  "fields": [
    "mathematics"
  ],
  "wikipedia_url": "https://en.wikipedia.org/wiki/John_Robertson_(mathematician)",
  "wikipedia_data": {
    "url": "https://en.wikipedia.org/wiki/John_Robertson_(mathematician)",
    "title": "John Robertson (mathematician)",
    "page_title": "John_Robertson_(mathematician)",
    "biography_paragraphs": [
      "John Robertson (1712–1776) was an English mathematician, and a Fellow, clerk and librarian of the Royal Society. His book The Elements of Navigation became a classic textbook.",
      "Initially apprenticed to a trade, Robertson became a teacher of mathematics. He was elected a Fellow of the Royal Society in 1741. In 1747 he was appointed master of the Royal Mathematical School at Christ's Hospital, assistant there to James Hodgson.[1][2]",
      "In 1755 Robertson became first master of the Royal Naval Academy, Portsmouth. Having lost this appointment in 1766 through intrigues of the second master, he returned to London, and was appointed clerk and librarian to the Royal Society on 7 January 1768. This post he held till his death, on 11 December 1776.[1]",
      "Robertson published his first book Completed Treatise on Mensuration in 1739 and was subsequently elected a fellow of the Royal Society in 1741.[3] In 1747 he published the first edition of A Treatise of Such Mathematical Instruments as are Usually put into a Portable Case, which went through four editions in the coming 30 years and became a text book at the Royal Mathematical School and the Royal Navy Academy.[4]",
      "Since the opening of the Royal Mathematical School its masters wrote high quality mathematical textbooks. In this tradition Robertson wrote the two volume book The Elements of Navigation Containing the Theory and Practice, with the Necessary Tables and Compendiums for Finding the Latitude and Longitude as Sea, to which is Added a Treatise on Marine Fortification.[5] The first edition was published in 1754, and The Elements of Navigation went through seven editions in fifty years.[1] The first volume included sections on logarithms, Euclidean geometry, plane trigonometry, spherics, geography, plane sailing, oblique sailing, current sailing, globular sailing, parallel sailing, middle latitudes and Mercator's sailing, great circular sailing, astronomy, use of globes, as well as estimating distances and fortification.[6]"
    ],
    "infobox": {},
    "scraped_at": "2025-08-11T01:12:49.346599",
    "raw_html_length": 84571
  },
  "processed_at": "2025-08-11T01:12:50.351745",
  "wikidata_info": {
    "wikidata_id": "Q18783793",
    "name": "John Robertson",
    "birth_year": 1707,
    "death_year": 1776,
    "birth_date_full": "1707-01-01T00:00:00Z",
    "death_date_full": "1776-01-01T00:00:00Z",
    "wikipedia_url": "https://en.wikipedia.org/wiki/John_Robertson_(mathematician)",
    "nationality": "",
    "birth_place": {
      "name": "",
      "wikidata_uri": "",
      "coordinates": null
    },
    "image_url": "",
    "fields": [
      "mathematics"
    ],
    "data_source": "wikidata_sparql",
    "extracted_at": "2025-08-11T01:11:25.225189",
    "wikidata_query_metadata": {
      "query_date": "2025-08-11T01:11:25.225190",
      "endpoint": "https://query.wikidata.org/sparql",
      "data_quality": "structured"
    }
  }
}