{
  "id": null,
  "name": "Louis Godin",
  "birth_year": 1704,
  "death_year": 1760,
  "nationality": "European",
  "fields": [
    "mathematics"
  ],
  "wikipedia_url": "https://en.wikipedia.org/wiki/Louis_Godin",
  "wikipedia_data": {
    "url": "https://en.wikipedia.org/wiki/Louis_Godin",
    "title": "Louis Godin",
    "page_title": "Louis_Godin",
    "biography_paragraphs": [
      "Louis Godin (28 February 1704 – 11 September 1760)[1] was a French astronomer and member of the French Academy of Sciences. He worked in Peru, Spain, Portugal and France.",
      "Godin was born in Paris; his parents were François Godin and Elisabeth Charron.[1]   He was graduated at the College of Louis le Grand, and studied astronomy under Joseph-Nicolas Delisle. His astronomical tables (1724) gave him reputation, and the French Academy of Sciences elected him a pensionary member. He was commissioned to write a continuation of the history of the academy, left uncompleted by Bernard le Bovier de Fontenelle, and was also authorized to submit to the minister, Cardinal André-Hercule de Fleury, the best means of discovering the truth in regard to the figure of the Earth, and proposed sending expeditions to the equator and the polar sea. The minister approved the plan and appropriated the necessary means, the academy designating Charles Marie de La Condamine, Pierre Bouguer, and Godin to go to Peru in 1734.",
      "The expedition sailed from La Rochelle on 16 May 1735, touched at Cadiz to take two naval lieutenants, Jorge Juan y Santacilia and Antonio de Ulloa,[2] whom Philip V had ordered to accompany it, and proceeded to Santo Domingo, where they remained six months to take observations. They arrived in Quito in February 1736, immediately crossed the Andes to establish their stations in the interior, and remained two years.",
      "When they had finished their task in 1738, at the invitation of the Viceroy of Peru, Godin accepted the professorship in mathematics in Lima, where he also established a course of astronomical lectures. When the 1746 Lima–Callao earthquake destroyed the greater part of Lima, he took valuable seismological observations, assisted the sufferers, and made plans by the use of which the new buildings would be less exposed to danger from renewed shocks.",
      "In 1751 he returned to Europe, but found that he had been nearly forgotten, and superseded as pensioner of the academy; and, as his fortune had been lost in unfortunate speculations, he accepted the presidency of the college for midshipmen in Cádiz in Spain in 1752. During the 1755 Lisbon earthquake, which was distinctly felt at Cádiz, he took observations and did much to allay the apprehensions of the public, for which he was ennobled by the king of Spain. In 1759 he was called to Paris and reinstated as pensionary member of the academy, but he died on his return to Cádiz."
    ],
    "infobox": {
      "birth": "(1704-02-28)28 February 1704Paris, France",
      "death": "11 September 1760(1760-09-11) (aged 56)Cadiz, Andalucía, Spain",
      "education": "College of Louis le Grand",
      "fields": "Astronomy"
    },
    "scraped_at": "2025-08-11T01:12:32.724970",
    "raw_html_length": 87719
  },
  "processed_at": "2025-08-11T01:12:33.730263",
  "wikidata_info": {
    "wikidata_id": "Q1241227",
    "name": "Louis Godin",
    "birth_year": 1704,
    "death_year": 1760,
    "birth_date_full": "1704-02-28T00:00:00Z",
    "death_date_full": "1760-09-11T00:00:00Z",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Louis_Godin",
    "nationality": "",
    "birth_place": {
      "name": "",
      "wikidata_uri": "",
      "coordinates": null
    },
    "image_url": "",
    "fields": [
      "mathematics"
    ],
    "data_source": "wikidata_sparql",
    "extracted_at": "2025-08-11T01:11:25.225056",
    "wikidata_query_metadata": {
      "query_date": "2025-08-11T01:11:25.225057",
      "endpoint": "https://query.wikidata.org/sparql",
      "data_quality": "structured"
    }
  }
}