{
  "id": null,
  "name": "Daniel Bernoulli",
  "birth_year": 1700,
  "death_year": 1782,
  "nationality": "European",
  "fields": [
    "mathematics"
  ],
  "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Bernoulli",
  "wikipedia_data": {
    "url": "https://en.wikipedia.org/wiki/Daniel_Bernoulli",
    "title": "Daniel Bernoulli",
    "page_title": "Daniel_Bernoulli",
    "biography_paragraphs": [
      "Daniel Bernoulli FRS (/bɜːrˈnuːli/ bur-NOO-lee; Swiss Standard German: [ˈdaːni̯eːl bɛrˈnʊli];[1] 8 February [O.S. 29 January] 1700 – 27 March 1782) was a Swiss mathematician and physicist and was one of the many prominent mathematicians in the Bernoulli family from Basel. He is particularly remembered for his applications of mathematics to mechanics, especially fluid mechanics, and for his pioneering work in probability and statistics.[2] His name is commemorated in the Bernoulli's principle, a particular example of the conservation of energy, which describes the mathematics of the mechanism underlying the operation of two important technologies of the 20th century: the carburetor and the aeroplane wing.[3][4]",
      "Daniel Bernoulli was born in Groningen, in the Netherlands, into a family of distinguished mathematicians.[5] The Bernoulli family came originally from Antwerp, at that time in the Spanish Netherlands, but emigrated to escape the Spanish persecution of the Protestants. After a brief period in Frankfurt the family moved to Basel, in Switzerland.",
      "Daniel was the son of Johann Bernoulli (one of the early developers of calculus) and a nephew of Jacob Bernoulli (an early researcher in probability theory and the discoverer of the mathematical constant e).[5] He had two brothers, Niklaus and Johann II. Daniel Bernoulli was described by W. W. Rouse Ball as \"by far the ablest of the younger Bernoullis\".[6]",
      "He is said to have had a bad relationship with his father. Both of them entered and tied for first place in a scientific contest at the University of Paris. Johann banned Daniel from his house, allegedly being unable to bear the \"shame\" of Daniel being considered his equal. Johann allegedly plagiarized key ideas from Daniel's book Hydrodynamica in his book Hydraulica and backdated them to before Hydrodynamica.[citation needed] Daniel's attempts at reconciliation with his father were unsuccessful.[7]",
      "When he was in school, Johann encouraged Daniel to study business citing poor financial compensation for mathematicians. Daniel initially refused but later relented and studied both business and medicine at his father's behest under the condition that his father would teach him mathematics privately.[7] Daniel studied medicine at Basel, Heidelberg, and Strasbourg, and earned a PhD in anatomy and botany in 1721."
    ],
    "infobox": {
      "birth": "8 February 1700Groningen, Dutch Republic",
      "death": "27 March 1782 (aged 82)Basel, Republic of the Swiss",
      "education": "University of Basel (M.D., 1721)Heidelberg UniversityUniversity of Strasbourg",
      "fields": "Mathematics, physics, medicine"
    },
    "scraped_at": "2025-08-11T01:11:27.072540",
    "raw_html_length": 204188
  },
  "processed_at": "2025-08-11T01:11:28.077810",
  "wikidata_info": {
    "wikidata_id": "Q122366",
    "name": "Daniel Bernoulli",
    "birth_year": 1700,
    "death_year": 1782,
    "birth_date_full": "1700-02-08T00:00:00Z",
    "death_date_full": "1782-03-17T00:00:00Z",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Daniel_Bernoulli",
    "nationality": "",
    "birth_place": {
      "name": "",
      "wikidata_uri": "",
      "coordinates": null
    },
    "image_url": "",
    "fields": [
      "mathematics"
    ],
    "data_source": "wikidata_sparql",
    "extracted_at": "2025-08-11T01:11:25.224745",
    "wikidata_query_metadata": {
      "query_date": "2025-08-11T01:11:25.224746",
      "endpoint": "https://query.wikidata.org/sparql",
      "data_quality": "structured"
    }
  }
}