{
  "id": null,
  "name": "Jacopo Belgrado",
  "birth_year": 1704,
  "death_year": 1789,
  "nationality": "European",
  "fields": [
    "mathematics"
  ],
  "wikipedia_url": "https://en.wikipedia.org/wiki/Jacopo_Belgrado",
  "wikipedia_data": {
    "url": "https://en.wikipedia.org/wiki/Jacopo_Belgrado",
    "title": "Jacopo Belgrado",
    "page_title": "Jacopo_Belgrado",
    "biography_paragraphs": [
      "Jacopo Belgrado, sometimes written Giacopo (November 16, 1704 in Udine – March 26, 1789 in Udine), was an Italian Jesuit, mathematician and natural philosopher.[1]",
      "Jacopo belonged to a noble family and received his education at Padua. He entered the novitiate of the Society of Jesus 16 October 1723, and showed marked talent, studying mathematics and philosophy at Bologna, under Father Luigi Marchenti, a former pupil of Pierre Varignon at Paris. After completing his philosophical studies he taught letters for several years at Venice.",
      "He studied theology at Parma and then became professor of mathematics and physics at the university, holding this position for twelve years. While at Parma he did much experimental work in physics with apparatus specially constructed by two of his assistants. After pronouncing his solemn vows on 2 February 1742, Belgrado was summoned to the court, where he was appointed confessor, first to the Duchess, and later to the Duke Don Filippo, The title of mathematician of the court was also bestowed on him.",
      "In 1757 Belgrado erected an observatory on one of the towers of the college of Parma and furnished it with the necessary instruments. He provided the observatory of a Gregorian telescope, a Parisian one, twenty-five feet long, two other smaller telescopes, a sundial, two pendulums and an astronomical clock of three feet radius.[2] For the construction of the observatory Belgrado collaborated with the famous astronomer Giuseppe Bolsi-Marchesi, who had worked for forty years in Bologna together with Eustachio Manfredi.",
      "In 1773, he became rector of the college at Bologna. He was a member of most of the academies of Italy and a corresponding member of the French Academy of Sciences. He was likewise one of the founders of the Arcadian colony of Parma."
    ],
    "infobox": {
      "birth": "(1704-11-16)November 16, 1704Udine, Republic of Venice",
      "death": "26 March 1789(1789-03-26) (aged 84)Udine, Republic of Venice",
      "fields": "Physics and natural philosophy"
    },
    "scraped_at": "2025-08-11T01:12:37.462536",
    "raw_html_length": 104170
  },
  "processed_at": "2025-08-11T01:12:38.469536",
  "wikidata_info": {
    "wikidata_id": "Q3805845",
    "name": "Jacopo Belgrado",
    "birth_year": 1704,
    "death_year": 1789,
    "birth_date_full": "1704-11-16T00:00:00Z",
    "death_date_full": "1789-03-26T00:00:00Z",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Jacopo_Belgrado",
    "nationality": "",
    "birth_place": {
      "name": "",
      "wikidata_uri": "",
      "coordinates": null
    },
    "image_url": "",
    "fields": [
      "mathematics"
    ],
    "data_source": "wikidata_sparql",
    "extracted_at": "2025-08-11T01:11:25.225081",
    "wikidata_query_metadata": {
      "query_date": "2025-08-11T01:11:25.225082",
      "endpoint": "https://query.wikidata.org/sparql",
      "data_quality": "structured"
    }
  }
}