{
  "id": null,
  "name": "Johann Peter Süssmilch",
  "birth_year": 1707,
  "death_year": 1767,
  "nationality": "European",
  "fields": [
    "mathematics"
  ],
  "wikipedia_url": "https://en.wikipedia.org/wiki/Johann_Peter_S%C3%BCssmilch",
  "wikipedia_data": {
    "url": "https://en.wikipedia.org/wiki/Johann_Peter_S%C3%BCssmilch",
    "title": "Johann Peter Süssmilch",
    "page_title": "Johann_Peter_S%C3%BCssmilch",
    "biography_paragraphs": [
      "Johann Peter Süßmilch or Süssmilch (September 3, 1707 in Zehlendorf – March 22, 1767 in Berlin) was a German Protestant pastor, statistician and demographer.[1][2] He is most well-known for his work The Divine order in the changes in the human sex from birth, death and reproduction of the same, which was an influential work in demography and the history of population statistics.[3][4][5]",
      "He was raised in Brandenburg by his grandparents.[2] From 1716 to 1722, he studied at the College of Berlin where he took an interest in natural history.[2] In 1724, he attended the Anatomical Institute in Berlin.[2] His parents persuaded him to study law at Halle in 1727, but he ultimately lost interest in law and switched his focus to theology.[2][3] In 1728, he began studying theology and philosophy at Jena.[3] He defended his thesis in 1733.[2]",
      "In 1741, he was an army chaplain in the First Silesian War. On Sunday, 13 August 1741, the former field preacher gave his inaugural sermon as pastor of the community Etzin.[6] In 1742 he took a post as Provost in the St. Petri parish in Berlin-Cölln. He became a member of the Prussian Academy of Sciences in 1745. He conversed with Gotthold Ephraim Lessing and Immanuel Kant.",
      "Süßmilch's most important publication on The Divine order in the circumstances of the human sex, birth, death and reproduction, which he wrote in 1741, is regarded as a seminal and pioneering work in demography and the history of population statistics. Süssmilch discovered that, in the long term, there is a constant sex ratio of 1,000 female births to 1,050 male births. He saw this as a proof of the Divine working in this World. Due to this work, he can be regarded as one of the founding fathers of demography in Germany. However, he refers in his work to Caspar Neumann's work, who calculated a monthly statistics of deaths by age and death cause already between 1687 and 1691 in Breslau (present-day Wrocław). Süssmilch also worked on life tables."
    ],
    "infobox": {},
    "scraped_at": "2025-08-11T01:12:55.275212",
    "raw_html_length": 90426
  },
  "processed_at": "2025-08-11T01:12:56.278630",
  "wikidata_info": {
    "wikidata_id": "Q64375",
    "name": "Johann Peter Süssmilch",
    "birth_year": 1707,
    "death_year": 1767,
    "birth_date_full": "1707-09-03T00:00:00Z",
    "death_date_full": "1767-03-22T00:00:00Z",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Johann_Peter_S%C3%BCssmilch",
    "nationality": "",
    "birth_place": {
      "name": "",
      "wikidata_uri": "",
      "coordinates": null
    },
    "image_url": "",
    "fields": [
      "mathematics"
    ],
    "data_source": "wikidata_sparql",
    "extracted_at": "2025-08-11T01:11:25.225247",
    "wikidata_query_metadata": {
      "query_date": "2025-08-11T01:11:25.225248",
      "endpoint": "https://query.wikidata.org/sparql",
      "data_quality": "structured"
    }
  }
}