{
  "id": null,
  "name": "João de Loureiro",
  "birth_year": 1710,
  "death_year": 1791,
  "nationality": "French",
  "fields": [
    "mathematics"
  ],
  "wikipedia_url": "https://en.wikipedia.org/wiki/Jo%C3%A3o_de_Loureiro",
  "wikipedia_data": {
    "url": "https://en.wikipedia.org/wiki/Jo%C3%A3o_de_Loureiro",
    "title": "João de Loureiro",
    "page_title": "Jo%C3%A3o_de_Loureiro",
    "biography_paragraphs": [
      "João de Loureiro (1717, Lisbon – 18 October 1791) was a Portuguese Jesuit missionary and botanist. [1]",
      "After receiving admission to the Jesuit Order, João de Loureiro served as a missionary in Goa, capital of Portuguese India (3 years) and Macau (4 years). In 1742 he traveled to Đàng Trong (known to the Europeans as Cochinchina), remaining there for 35 years. Here he worked as a mathematician and naturalist for the king of Đàng Trong,[2] acquiring knowledge on the properties and uses of native medicinal plants. In 1777, he journeyed to Canton, in Bengal, returning to Lisbon four years later.[3] During this period, Captain Thomas Riddel gave Loureiro the books Systema Naturae, Genera Plantarum and Philosophia Botanica by Carl Linnaeus, which greatly influenced the Portuguese botanist.[4]",
      "João de Loureiro stayed in Vietnam forty years inventorying indigenous herbal remedies. His local garden contained 1,000 unique herbal species, making it one of the greatest botanist collectors of the 18th century.[2]",
      "João de Loureiro published the book Flora Cochinchinensis 1790, sponsored by the Royal Portuguese Academy of Sciences.[4] João de Loureiro has numerous species dedicated to him by the epitheton \"loureiroi\" , mostly plants but also a dinosaur Draconyx loureiroi in honour of his being the first Portuguese palaeontologist.[5]",
      "The taxonomist Elmer Drew Merrill later argued that Loureiro's work contained various mistakes caused by a misunderstanding of the Linnaean system.[4]"
    ],
    "infobox": {},
    "scraped_at": "2025-08-11T01:13:03.467063",
    "raw_html_length": 97588
  },
  "processed_at": "2025-08-11T01:13:04.478190",
  "wikidata_info": {
    "wikidata_id": "Q729917",
    "name": "João de Loureiro",
    "birth_year": 1710,
    "death_year": 1791,
    "birth_date_full": "1710-01-01T00:00:00Z",
    "death_date_full": "1791-10-18T00:00:00Z",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Jo%C3%A3o_de_Loureiro",
    "nationality": "",
    "birth_place": {
      "name": "",
      "wikidata_uri": "",
      "coordinates": null
    },
    "image_url": "",
    "fields": [
      "mathematics"
    ],
    "data_source": "wikidata_sparql",
    "extracted_at": "2025-08-11T01:11:25.225402",
    "wikidata_query_metadata": {
      "query_date": "2025-08-11T01:11:25.225403",
      "endpoint": "https://query.wikidata.org/sparql",
      "data_quality": "structured"
    }
  }
}