{
  "id": "jean_le_rond_d'alembert",
  "name": "Jean le Rond d'Alembert",
  "birth_year": 1717,
  "death_year": 1783,
  "nationality": "French",
  "fields": [
    "mathematics"
  ],
  "wikipedia_url": "https://en.wikipedia.org/wiki/Jean_le_Rond_d%27Alembert",
  "wikipedia_data": {
    "url": "https://en.wikipedia.org/wiki/Jean_le_Rond_d%27Alembert",
    "title": "Jean le Rond d'Alembert",
    "page_title": "Jean_le_Rond_d%27Alembert",
    "biography_paragraphs": [
      "Jean-Baptiste le Rond d'Alembert[a] (/ˌdæləmˈbɛər/ DAL-əm-BAIR;[1] French: [ʒɑ̃ batist lə ʁɔ̃ dalɑ̃bɛʁ]; 16 November 1717 – 29 October 1783) was a French mathematician, mechanician, physicist, philosopher, and music theorist. Until 1759 he was, together with Denis Diderot, a co-editor of the Encyclopédie.[2] D'Alembert's formula for obtaining solutions to the wave equation is named after him.[3][4][5] The wave equation is sometimes referred to as d'Alembert's equation, and the fundamental theorem of algebra is named after d'Alembert in French.",
      "Born in Paris, d'Alembert was the natural son of the writer Claudine Guérin de Tencin and the chevalier Louis-Camus Destouches, an artillery officer. Destouches was abroad at the time of d'Alembert's birth. Days after birth his mother left him on the steps of the Saint-Jean-le-Rond de Paris church. According to custom, he was named after the patron saint of the church. D'Alembert was placed in an orphanage for foundling children, but his father found him and placed him with the wife of a glazier, Madame Rousseau, with whom he lived for nearly 50 years.[6] She gave him little encouragement. When he told her of some discovery he had made or something he had written she generally replied,",
      "You will never be anything but a philosopher—and what is that but an ass who plagues himself all his life, that he may be talked about after he is dead.[7]",
      "Destouches secretly paid for the education of Jean le Rond, but did not want his paternity officially recognised.",
      "D'Alembert first attended a private school. The chevalier Destouches left d'Alembert an annuity of 1,200 livres on his death in 1726. Under the influence of the Destouches family, at the age of 12 d'Alembert entered the Jansenist Collège des Quatre-Nations (the institution was also known under the name \"Collège Mazarin\"). Here he studied philosophy, law, and the arts, graduating as baccalauréat en arts in 1735."
    ],
    "infobox": {
      "birth": "Jean-Baptiste le Rond d'Alembert(1717-11-16)16 November 1717Paris, France",
      "death": "29 October 1783(1783-10-29) (aged 65)Paris, France",
      "nationality": "French",
      "fields": "MathematicsMechanicsPhysicsPhilosophy"
    },
    "scraped_at": "2025-08-10T23:39:59.903960",
    "raw_html_length": 265960
  },
  "processed_at": "2025-08-10T23:40:01.408536"
}